/* automatically generated by rust-bindgen */

#![allow(improper_ctypes)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(non_upper_case_globals)]

#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl <T> __BindgenUnionField<T> {
    #[inline]
    pub fn new() -> Self { __BindgenUnionField(::std::marker::PhantomData) }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T { ::std::mem::transmute(self) }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T { ::std::mem::transmute(self) }
}
impl <T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self { Self::new() }
}
impl <T> ::std::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self { Self::new() }
}
impl <T> ::std::marker::Copy for __BindgenUnionField<T> { }
impl <T> ::std::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
pub const EI_NIDENT: ::std::os::raw::c_uint = 16;
pub const EI_MAG0: ::std::os::raw::c_uint = 0;
pub const ELFMAG0: ::std::os::raw::c_uint = 127;
pub const EI_MAG1: ::std::os::raw::c_uint = 1;
pub const ELFMAG1: u8 = b'E';
pub const EI_MAG2: ::std::os::raw::c_uint = 2;
pub const ELFMAG2: u8 = b'L';
pub const EI_MAG3: ::std::os::raw::c_uint = 3;
pub const ELFMAG3: u8 = b'F';
pub const ELFMAG: &'static [u8; 5usize] = b"\x7fELF\x00";

pub const R_METAG_GETSET_GOTOFF: ::std::os::raw::c_uint = 34;
pub const R_METAG_GETSET_GOT: ::std::os::raw::c_uint = 35;
pub const R_METAG_HI16_GOTPC: ::std::os::raw::c_uint = 36;
pub const R_METAG_LO16_GOTPC: ::std::os::raw::c_uint = 37;
pub const R_METAG_HI16_PLT: ::std::os::raw::c_uint = 38;
pub const R_METAG_LO16_PLT: ::std::os::raw::c_uint = 39;
pub const R_METAG_RELBRANCH_PLT: ::std::os::raw::c_uint = 40;
pub const R_METAG_GOTOFF: ::std::os::raw::c_uint = 41;
pub const R_METAG_PLT: ::std::os::raw::c_uint = 42;
pub const R_METAG_COPY: ::std::os::raw::c_uint = 43;
pub const R_METAG_JMP_SLOT: ::std::os::raw::c_uint = 44;
pub const R_METAG_RELATIVE: ::std::os::raw::c_uint = 45;
pub const R_METAG_GLOB_DAT: ::std::os::raw::c_uint = 46;
pub const R_METAG_TLS_GD: ::std::os::raw::c_uint = 47;
pub const R_METAG_TLS_LDM: ::std::os::raw::c_uint = 48;
pub const R_METAG_TLS_LDO_HI16: ::std::os::raw::c_uint = 49;
pub const R_METAG_TLS_LDO_LO16: ::std::os::raw::c_uint = 50;
pub const R_METAG_TLS_LDO: ::std::os::raw::c_uint = 51;
pub const R_METAG_TLS_IE: ::std::os::raw::c_uint = 52;
pub const R_METAG_TLS_IENONPIC: ::std::os::raw::c_uint = 53;
pub const R_METAG_TLS_IENONPIC_HI16: ::std::os::raw::c_uint = 54;
pub const R_METAG_TLS_IENONPIC_LO16: ::std::os::raw::c_uint = 55;
pub const R_METAG_TLS_TPOFF: ::std::os::raw::c_uint = 56;
pub const R_METAG_TLS_DTPMOD: ::std::os::raw::c_uint = 57;
pub const R_METAG_TLS_DTPOFF: ::std::os::raw::c_uint = 58;
pub const R_METAG_TLS_LE: ::std::os::raw::c_uint = 59;
pub const R_METAG_TLS_LE_HI16: ::std::os::raw::c_uint = 60;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type uid_t = __uid_t;
pub type time_t = __time_t;
pub type Elf32_Half = u16;
pub type Elf64_Half = u16;
pub type Elf32_Word = u32;
pub type Elf32_Sword = i32;
pub type Elf64_Word = u32;
pub type Elf64_Sword = i32;
pub type Elf32_Xword = u64;
pub type Elf32_Sxword = i64;
pub type Elf64_Xword = u64;
pub type Elf64_Sxword = i64;
pub type Elf32_Addr = u32;
pub type Elf64_Addr = u64;
pub type Elf32_Off = u32;
pub type Elf64_Off = u64;
pub type Elf32_Section = u16;
pub type Elf64_Section = u16;
pub type Elf32_Versym = Elf32_Half;
pub type Elf64_Versym = Elf64_Half;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Ehdr {
    pub e_ident: [::std::os::raw::c_uchar; 16usize],
    pub e_type: Elf32_Half,
    pub e_machine: Elf32_Half,
    pub e_version: Elf32_Word,
    pub e_entry: Elf32_Addr,
    pub e_phoff: Elf32_Off,
    pub e_shoff: Elf32_Off,
    pub e_flags: Elf32_Word,
    pub e_ehsize: Elf32_Half,
    pub e_phentsize: Elf32_Half,
    pub e_phnum: Elf32_Half,
    pub e_shentsize: Elf32_Half,
    pub e_shnum: Elf32_Half,
    pub e_shstrndx: Elf32_Half,
}
#[test]
fn bindgen_test_layout_Elf32_Ehdr() {
    assert_eq!(::std::mem::size_of::<Elf32_Ehdr>() , 52usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Ehdr ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Ehdr>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Ehdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Ehdr ) ) . e_ident as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Ehdr ) , "::" ,
                stringify ! ( e_ident ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Ehdr ) ) . e_type as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Ehdr ) , "::" ,
                stringify ! ( e_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Ehdr ) ) . e_machine as * const _
                as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Ehdr ) , "::" ,
                stringify ! ( e_machine ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Ehdr ) ) . e_version as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Ehdr ) , "::" ,
                stringify ! ( e_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Ehdr ) ) . e_entry as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Ehdr ) , "::" ,
                stringify ! ( e_entry ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Ehdr ) ) . e_phoff as * const _ as
                usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Ehdr ) , "::" ,
                stringify ! ( e_phoff ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Ehdr ) ) . e_shoff as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Ehdr ) , "::" ,
                stringify ! ( e_shoff ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Ehdr ) ) . e_flags as * const _ as
                usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Ehdr ) , "::" ,
                stringify ! ( e_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Ehdr ) ) . e_ehsize as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Ehdr ) , "::" ,
                stringify ! ( e_ehsize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Ehdr ) ) . e_phentsize as * const _
                as usize } , 42usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Ehdr ) , "::" ,
                stringify ! ( e_phentsize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Ehdr ) ) . e_phnum as * const _ as
                usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Ehdr ) , "::" ,
                stringify ! ( e_phnum ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Ehdr ) ) . e_shentsize as * const _
                as usize } , 46usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Ehdr ) , "::" ,
                stringify ! ( e_shentsize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Ehdr ) ) . e_shnum as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Ehdr ) , "::" ,
                stringify ! ( e_shnum ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Ehdr ) ) . e_shstrndx as * const _
                as usize } , 50usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Ehdr ) , "::" ,
                stringify ! ( e_shstrndx ) ));
}
impl Clone for Elf32_Ehdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Ehdr {
    pub e_ident: [::std::os::raw::c_uchar; 16usize],
    pub e_type: Elf64_Half,
    pub e_machine: Elf64_Half,
    pub e_version: Elf64_Word,
    pub e_entry: Elf64_Addr,
    pub e_phoff: Elf64_Off,
    pub e_shoff: Elf64_Off,
    pub e_flags: Elf64_Word,
    pub e_ehsize: Elf64_Half,
    pub e_phentsize: Elf64_Half,
    pub e_phnum: Elf64_Half,
    pub e_shentsize: Elf64_Half,
    pub e_shnum: Elf64_Half,
    pub e_shstrndx: Elf64_Half,
}
#[test]
fn bindgen_test_layout_Elf64_Ehdr() {
    assert_eq!(::std::mem::size_of::<Elf64_Ehdr>() , 64usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Ehdr ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Ehdr>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Ehdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Ehdr ) ) . e_ident as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Ehdr ) , "::" ,
                stringify ! ( e_ident ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Ehdr ) ) . e_type as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Ehdr ) , "::" ,
                stringify ! ( e_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Ehdr ) ) . e_machine as * const _
                as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Ehdr ) , "::" ,
                stringify ! ( e_machine ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Ehdr ) ) . e_version as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Ehdr ) , "::" ,
                stringify ! ( e_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Ehdr ) ) . e_entry as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Ehdr ) , "::" ,
                stringify ! ( e_entry ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Ehdr ) ) . e_phoff as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Ehdr ) , "::" ,
                stringify ! ( e_phoff ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Ehdr ) ) . e_shoff as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Ehdr ) , "::" ,
                stringify ! ( e_shoff ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Ehdr ) ) . e_flags as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Ehdr ) , "::" ,
                stringify ! ( e_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Ehdr ) ) . e_ehsize as * const _ as
                usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Ehdr ) , "::" ,
                stringify ! ( e_ehsize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Ehdr ) ) . e_phentsize as * const _
                as usize } , 54usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Ehdr ) , "::" ,
                stringify ! ( e_phentsize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Ehdr ) ) . e_phnum as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Ehdr ) , "::" ,
                stringify ! ( e_phnum ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Ehdr ) ) . e_shentsize as * const _
                as usize } , 58usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Ehdr ) , "::" ,
                stringify ! ( e_shentsize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Ehdr ) ) . e_shnum as * const _ as
                usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Ehdr ) , "::" ,
                stringify ! ( e_shnum ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Ehdr ) ) . e_shstrndx as * const _
                as usize } , 62usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Ehdr ) , "::" ,
                stringify ! ( e_shstrndx ) ));
}
impl Clone for Elf64_Ehdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Shdr {
    pub sh_name: Elf32_Word,
    pub sh_type: Elf32_Word,
    pub sh_flags: Elf32_Word,
    pub sh_addr: Elf32_Addr,
    pub sh_offset: Elf32_Off,
    pub sh_size: Elf32_Word,
    pub sh_link: Elf32_Word,
    pub sh_info: Elf32_Word,
    pub sh_addralign: Elf32_Word,
    pub sh_entsize: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Shdr() {
    assert_eq!(::std::mem::size_of::<Elf32_Shdr>() , 40usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Shdr ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Shdr>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Shdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Shdr ) ) . sh_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Shdr ) , "::" ,
                stringify ! ( sh_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Shdr ) ) . sh_type as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Shdr ) , "::" ,
                stringify ! ( sh_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Shdr ) ) . sh_flags as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Shdr ) , "::" ,
                stringify ! ( sh_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Shdr ) ) . sh_addr as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Shdr ) , "::" ,
                stringify ! ( sh_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Shdr ) ) . sh_offset as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Shdr ) , "::" ,
                stringify ! ( sh_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Shdr ) ) . sh_size as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Shdr ) , "::" ,
                stringify ! ( sh_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Shdr ) ) . sh_link as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Shdr ) , "::" ,
                stringify ! ( sh_link ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Shdr ) ) . sh_info as * const _ as
                usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Shdr ) , "::" ,
                stringify ! ( sh_info ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Shdr ) ) . sh_addralign as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Shdr ) , "::" ,
                stringify ! ( sh_addralign ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Shdr ) ) . sh_entsize as * const _
                as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Shdr ) , "::" ,
                stringify ! ( sh_entsize ) ));
}
impl Clone for Elf32_Shdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Shdr {
    pub sh_name: Elf64_Word,
    pub sh_type: Elf64_Word,
    pub sh_flags: Elf64_Xword,
    pub sh_addr: Elf64_Addr,
    pub sh_offset: Elf64_Off,
    pub sh_size: Elf64_Xword,
    pub sh_link: Elf64_Word,
    pub sh_info: Elf64_Word,
    pub sh_addralign: Elf64_Xword,
    pub sh_entsize: Elf64_Xword,
}
#[test]
fn bindgen_test_layout_Elf64_Shdr() {
    assert_eq!(::std::mem::size_of::<Elf64_Shdr>() , 64usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Shdr ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Shdr>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Shdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Shdr ) ) . sh_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Shdr ) , "::" ,
                stringify ! ( sh_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Shdr ) ) . sh_type as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Shdr ) , "::" ,
                stringify ! ( sh_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Shdr ) ) . sh_flags as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Shdr ) , "::" ,
                stringify ! ( sh_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Shdr ) ) . sh_addr as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Shdr ) , "::" ,
                stringify ! ( sh_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Shdr ) ) . sh_offset as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Shdr ) , "::" ,
                stringify ! ( sh_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Shdr ) ) . sh_size as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Shdr ) , "::" ,
                stringify ! ( sh_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Shdr ) ) . sh_link as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Shdr ) , "::" ,
                stringify ! ( sh_link ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Shdr ) ) . sh_info as * const _ as
                usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Shdr ) , "::" ,
                stringify ! ( sh_info ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Shdr ) ) . sh_addralign as * const
                _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Shdr ) , "::" ,
                stringify ! ( sh_addralign ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Shdr ) ) . sh_entsize as * const _
                as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Shdr ) , "::" ,
                stringify ! ( sh_entsize ) ));
}
impl Clone for Elf64_Shdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Chdr {
    pub ch_type: Elf32_Word,
    pub ch_size: Elf32_Word,
    pub ch_addralign: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Chdr() {
    assert_eq!(::std::mem::size_of::<Elf32_Chdr>() , 12usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Chdr ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Chdr>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Chdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Chdr ) ) . ch_type as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Chdr ) , "::" ,
                stringify ! ( ch_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Chdr ) ) . ch_size as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Chdr ) , "::" ,
                stringify ! ( ch_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Chdr ) ) . ch_addralign as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Chdr ) , "::" ,
                stringify ! ( ch_addralign ) ));
}
impl Clone for Elf32_Chdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Chdr {
    pub ch_type: Elf64_Word,
    pub ch_reserved: Elf64_Word,
    pub ch_size: Elf64_Xword,
    pub ch_addralign: Elf64_Xword,
}
#[test]
fn bindgen_test_layout_Elf64_Chdr() {
    assert_eq!(::std::mem::size_of::<Elf64_Chdr>() , 24usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Chdr ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Chdr>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Chdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Chdr ) ) . ch_type as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Chdr ) , "::" ,
                stringify ! ( ch_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Chdr ) ) . ch_reserved as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Chdr ) , "::" ,
                stringify ! ( ch_reserved ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Chdr ) ) . ch_size as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Chdr ) , "::" ,
                stringify ! ( ch_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Chdr ) ) . ch_addralign as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Chdr ) , "::" ,
                stringify ! ( ch_addralign ) ));
}
impl Clone for Elf64_Chdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Sym {
    pub st_name: Elf32_Word,
    pub st_value: Elf32_Addr,
    pub st_size: Elf32_Word,
    pub st_info: ::std::os::raw::c_uchar,
    pub st_other: ::std::os::raw::c_uchar,
    pub st_shndx: Elf32_Section,
}
#[test]
fn bindgen_test_layout_Elf32_Sym() {
    assert_eq!(::std::mem::size_of::<Elf32_Sym>() , 16usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Sym ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Sym>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Sym ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Sym ) ) . st_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Sym ) , "::" ,
                stringify ! ( st_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Sym ) ) . st_value as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Sym ) , "::" ,
                stringify ! ( st_value ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Sym ) ) . st_size as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Sym ) , "::" ,
                stringify ! ( st_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Sym ) ) . st_info as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Sym ) , "::" ,
                stringify ! ( st_info ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Sym ) ) . st_other as * const _ as
                usize } , 13usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Sym ) , "::" ,
                stringify ! ( st_other ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Sym ) ) . st_shndx as * const _ as
                usize } , 14usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Sym ) , "::" ,
                stringify ! ( st_shndx ) ));
}
impl Clone for Elf32_Sym {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Sym {
    pub st_name: Elf64_Word,
    pub st_info: ::std::os::raw::c_uchar,
    pub st_other: ::std::os::raw::c_uchar,
    pub st_shndx: Elf64_Section,
    pub st_value: Elf64_Addr,
    pub st_size: Elf64_Xword,
}
#[test]
fn bindgen_test_layout_Elf64_Sym() {
    assert_eq!(::std::mem::size_of::<Elf64_Sym>() , 24usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Sym ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Sym>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Sym ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Sym ) ) . st_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Sym ) , "::" ,
                stringify ! ( st_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Sym ) ) . st_info as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Sym ) , "::" ,
                stringify ! ( st_info ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Sym ) ) . st_other as * const _ as
                usize } , 5usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Sym ) , "::" ,
                stringify ! ( st_other ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Sym ) ) . st_shndx as * const _ as
                usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Sym ) , "::" ,
                stringify ! ( st_shndx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Sym ) ) . st_value as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Sym ) , "::" ,
                stringify ! ( st_value ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Sym ) ) . st_size as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Sym ) , "::" ,
                stringify ! ( st_size ) ));
}
impl Clone for Elf64_Sym {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Syminfo {
    pub si_boundto: Elf32_Half,
    pub si_flags: Elf32_Half,
}
#[test]
fn bindgen_test_layout_Elf32_Syminfo() {
    assert_eq!(::std::mem::size_of::<Elf32_Syminfo>() , 4usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Syminfo ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Syminfo>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Syminfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Syminfo ) ) . si_boundto as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Syminfo ) , "::"
                , stringify ! ( si_boundto ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Syminfo ) ) . si_flags as * const _
                as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Syminfo ) , "::"
                , stringify ! ( si_flags ) ));
}
impl Clone for Elf32_Syminfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Syminfo {
    pub si_boundto: Elf64_Half,
    pub si_flags: Elf64_Half,
}
#[test]
fn bindgen_test_layout_Elf64_Syminfo() {
    assert_eq!(::std::mem::size_of::<Elf64_Syminfo>() , 4usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Syminfo ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Syminfo>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Syminfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Syminfo ) ) . si_boundto as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Syminfo ) , "::"
                , stringify ! ( si_boundto ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Syminfo ) ) . si_flags as * const _
                as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Syminfo ) , "::"
                , stringify ! ( si_flags ) ));
}
impl Clone for Elf64_Syminfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Rel {
    pub r_offset: Elf32_Addr,
    pub r_info: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Rel() {
    assert_eq!(::std::mem::size_of::<Elf32_Rel>() , 8usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Rel ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Rel>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Rel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Rel ) ) . r_offset as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Rel ) , "::" ,
                stringify ! ( r_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Rel ) ) . r_info as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Rel ) , "::" ,
                stringify ! ( r_info ) ));
}
impl Clone for Elf32_Rel {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Rel {
    pub r_offset: Elf64_Addr,
    pub r_info: Elf64_Xword,
}
#[test]
fn bindgen_test_layout_Elf64_Rel() {
    assert_eq!(::std::mem::size_of::<Elf64_Rel>() , 16usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Rel ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Rel>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Rel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Rel ) ) . r_offset as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Rel ) , "::" ,
                stringify ! ( r_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Rel ) ) . r_info as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Rel ) , "::" ,
                stringify ! ( r_info ) ));
}
impl Clone for Elf64_Rel {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Rela {
    pub r_offset: Elf32_Addr,
    pub r_info: Elf32_Word,
    pub r_addend: Elf32_Sword,
}
#[test]
fn bindgen_test_layout_Elf32_Rela() {
    assert_eq!(::std::mem::size_of::<Elf32_Rela>() , 12usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Rela ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Rela>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Rela ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Rela ) ) . r_offset as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Rela ) , "::" ,
                stringify ! ( r_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Rela ) ) . r_info as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Rela ) , "::" ,
                stringify ! ( r_info ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Rela ) ) . r_addend as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Rela ) , "::" ,
                stringify ! ( r_addend ) ));
}
impl Clone for Elf32_Rela {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Rela {
    pub r_offset: Elf64_Addr,
    pub r_info: Elf64_Xword,
    pub r_addend: Elf64_Sxword,
}
#[test]
fn bindgen_test_layout_Elf64_Rela() {
    assert_eq!(::std::mem::size_of::<Elf64_Rela>() , 24usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Rela ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Rela>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Rela ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Rela ) ) . r_offset as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Rela ) , "::" ,
                stringify ! ( r_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Rela ) ) . r_info as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Rela ) , "::" ,
                stringify ! ( r_info ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Rela ) ) . r_addend as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Rela ) , "::" ,
                stringify ! ( r_addend ) ));
}
impl Clone for Elf64_Rela {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Phdr {
    pub p_type: Elf32_Word,
    pub p_offset: Elf32_Off,
    pub p_vaddr: Elf32_Addr,
    pub p_paddr: Elf32_Addr,
    pub p_filesz: Elf32_Word,
    pub p_memsz: Elf32_Word,
    pub p_flags: Elf32_Word,
    pub p_align: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Phdr() {
    assert_eq!(::std::mem::size_of::<Elf32_Phdr>() , 32usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Phdr ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Phdr>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Phdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Phdr ) ) . p_type as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Phdr ) , "::" ,
                stringify ! ( p_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Phdr ) ) . p_offset as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Phdr ) , "::" ,
                stringify ! ( p_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Phdr ) ) . p_vaddr as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Phdr ) , "::" ,
                stringify ! ( p_vaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Phdr ) ) . p_paddr as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Phdr ) , "::" ,
                stringify ! ( p_paddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Phdr ) ) . p_filesz as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Phdr ) , "::" ,
                stringify ! ( p_filesz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Phdr ) ) . p_memsz as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Phdr ) , "::" ,
                stringify ! ( p_memsz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Phdr ) ) . p_flags as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Phdr ) , "::" ,
                stringify ! ( p_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Phdr ) ) . p_align as * const _ as
                usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Phdr ) , "::" ,
                stringify ! ( p_align ) ));
}
impl Clone for Elf32_Phdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Phdr {
    pub p_type: Elf64_Word,
    pub p_flags: Elf64_Word,
    pub p_offset: Elf64_Off,
    pub p_vaddr: Elf64_Addr,
    pub p_paddr: Elf64_Addr,
    pub p_filesz: Elf64_Xword,
    pub p_memsz: Elf64_Xword,
    pub p_align: Elf64_Xword,
}
#[test]
fn bindgen_test_layout_Elf64_Phdr() {
    assert_eq!(::std::mem::size_of::<Elf64_Phdr>() , 56usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Phdr ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Phdr>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Phdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Phdr ) ) . p_type as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Phdr ) , "::" ,
                stringify ! ( p_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Phdr ) ) . p_flags as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Phdr ) , "::" ,
                stringify ! ( p_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Phdr ) ) . p_offset as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Phdr ) , "::" ,
                stringify ! ( p_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Phdr ) ) . p_vaddr as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Phdr ) , "::" ,
                stringify ! ( p_vaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Phdr ) ) . p_paddr as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Phdr ) , "::" ,
                stringify ! ( p_paddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Phdr ) ) . p_filesz as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Phdr ) , "::" ,
                stringify ! ( p_filesz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Phdr ) ) . p_memsz as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Phdr ) , "::" ,
                stringify ! ( p_memsz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Phdr ) ) . p_align as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Phdr ) , "::" ,
                stringify ! ( p_align ) ));
}
impl Clone for Elf64_Phdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Dyn {
    pub d_tag: Elf32_Sword,
    pub d_un: Elf32_Dyn__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Dyn__bindgen_ty_1 {
    pub d_val: __BindgenUnionField<Elf32_Word>,
    pub d_ptr: __BindgenUnionField<Elf32_Addr>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_Elf32_Dyn__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<Elf32_Dyn__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( Elf32_Dyn__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Dyn__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( Elf32_Dyn__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Dyn__bindgen_ty_1 ) ) . d_val as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Dyn__bindgen_ty_1
                ) , "::" , stringify ! ( d_val ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Dyn__bindgen_ty_1 ) ) . d_ptr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Dyn__bindgen_ty_1
                ) , "::" , stringify ! ( d_ptr ) ));
}
impl Clone for Elf32_Dyn__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_Elf32_Dyn() {
    assert_eq!(::std::mem::size_of::<Elf32_Dyn>() , 8usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Dyn ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Dyn>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Dyn ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Dyn ) ) . d_tag as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Dyn ) , "::" ,
                stringify ! ( d_tag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Dyn ) ) . d_un as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Dyn ) , "::" ,
                stringify ! ( d_un ) ));
}
impl Clone for Elf32_Dyn {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Dyn {
    pub d_tag: Elf64_Sxword,
    pub d_un: Elf64_Dyn__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Dyn__bindgen_ty_1 {
    pub d_val: __BindgenUnionField<Elf64_Xword>,
    pub d_ptr: __BindgenUnionField<Elf64_Addr>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_Elf64_Dyn__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<Elf64_Dyn__bindgen_ty_1>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( Elf64_Dyn__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Dyn__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( Elf64_Dyn__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Dyn__bindgen_ty_1 ) ) . d_val as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Dyn__bindgen_ty_1
                ) , "::" , stringify ! ( d_val ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Dyn__bindgen_ty_1 ) ) . d_ptr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Dyn__bindgen_ty_1
                ) , "::" , stringify ! ( d_ptr ) ));
}
impl Clone for Elf64_Dyn__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_Elf64_Dyn() {
    assert_eq!(::std::mem::size_of::<Elf64_Dyn>() , 16usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Dyn ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Dyn>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Dyn ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Dyn ) ) . d_tag as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Dyn ) , "::" ,
                stringify ! ( d_tag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Dyn ) ) . d_un as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Dyn ) , "::" ,
                stringify ! ( d_un ) ));
}
impl Clone for Elf64_Dyn {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Verdef {
    pub vd_version: Elf32_Half,
    pub vd_flags: Elf32_Half,
    pub vd_ndx: Elf32_Half,
    pub vd_cnt: Elf32_Half,
    pub vd_hash: Elf32_Word,
    pub vd_aux: Elf32_Word,
    pub vd_next: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Verdef() {
    assert_eq!(::std::mem::size_of::<Elf32_Verdef>() , 20usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Verdef ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Verdef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Verdef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Verdef ) ) . vd_version as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Verdef ) , "::" ,
                stringify ! ( vd_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Verdef ) ) . vd_flags as * const _
                as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Verdef ) , "::" ,
                stringify ! ( vd_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Verdef ) ) . vd_ndx as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Verdef ) , "::" ,
                stringify ! ( vd_ndx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Verdef ) ) . vd_cnt as * const _ as
                usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Verdef ) , "::" ,
                stringify ! ( vd_cnt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Verdef ) ) . vd_hash as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Verdef ) , "::" ,
                stringify ! ( vd_hash ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Verdef ) ) . vd_aux as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Verdef ) , "::" ,
                stringify ! ( vd_aux ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Verdef ) ) . vd_next as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Verdef ) , "::" ,
                stringify ! ( vd_next ) ));
}
impl Clone for Elf32_Verdef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Verdef {
    pub vd_version: Elf64_Half,
    pub vd_flags: Elf64_Half,
    pub vd_ndx: Elf64_Half,
    pub vd_cnt: Elf64_Half,
    pub vd_hash: Elf64_Word,
    pub vd_aux: Elf64_Word,
    pub vd_next: Elf64_Word,
}
#[test]
fn bindgen_test_layout_Elf64_Verdef() {
    assert_eq!(::std::mem::size_of::<Elf64_Verdef>() , 20usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Verdef ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Verdef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Verdef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Verdef ) ) . vd_version as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Verdef ) , "::" ,
                stringify ! ( vd_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Verdef ) ) . vd_flags as * const _
                as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Verdef ) , "::" ,
                stringify ! ( vd_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Verdef ) ) . vd_ndx as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Verdef ) , "::" ,
                stringify ! ( vd_ndx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Verdef ) ) . vd_cnt as * const _ as
                usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Verdef ) , "::" ,
                stringify ! ( vd_cnt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Verdef ) ) . vd_hash as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Verdef ) , "::" ,
                stringify ! ( vd_hash ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Verdef ) ) . vd_aux as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Verdef ) , "::" ,
                stringify ! ( vd_aux ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Verdef ) ) . vd_next as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Verdef ) , "::" ,
                stringify ! ( vd_next ) ));
}
impl Clone for Elf64_Verdef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Verdaux {
    pub vda_name: Elf32_Word,
    pub vda_next: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Verdaux() {
    assert_eq!(::std::mem::size_of::<Elf32_Verdaux>() , 8usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Verdaux ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Verdaux>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Verdaux ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Verdaux ) ) . vda_name as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Verdaux ) , "::"
                , stringify ! ( vda_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Verdaux ) ) . vda_next as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Verdaux ) , "::"
                , stringify ! ( vda_next ) ));
}
impl Clone for Elf32_Verdaux {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Verdaux {
    pub vda_name: Elf64_Word,
    pub vda_next: Elf64_Word,
}
#[test]
fn bindgen_test_layout_Elf64_Verdaux() {
    assert_eq!(::std::mem::size_of::<Elf64_Verdaux>() , 8usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Verdaux ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Verdaux>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Verdaux ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Verdaux ) ) . vda_name as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Verdaux ) , "::"
                , stringify ! ( vda_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Verdaux ) ) . vda_next as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Verdaux ) , "::"
                , stringify ! ( vda_next ) ));
}
impl Clone for Elf64_Verdaux {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Verneed {
    pub vn_version: Elf32_Half,
    pub vn_cnt: Elf32_Half,
    pub vn_file: Elf32_Word,
    pub vn_aux: Elf32_Word,
    pub vn_next: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Verneed() {
    assert_eq!(::std::mem::size_of::<Elf32_Verneed>() , 16usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Verneed ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Verneed>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Verneed ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Verneed ) ) . vn_version as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Verneed ) , "::"
                , stringify ! ( vn_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Verneed ) ) . vn_cnt as * const _
                as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Verneed ) , "::"
                , stringify ! ( vn_cnt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Verneed ) ) . vn_file as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Verneed ) , "::"
                , stringify ! ( vn_file ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Verneed ) ) . vn_aux as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Verneed ) , "::"
                , stringify ! ( vn_aux ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Verneed ) ) . vn_next as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Verneed ) , "::"
                , stringify ! ( vn_next ) ));
}
impl Clone for Elf32_Verneed {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Verneed {
    pub vn_version: Elf64_Half,
    pub vn_cnt: Elf64_Half,
    pub vn_file: Elf64_Word,
    pub vn_aux: Elf64_Word,
    pub vn_next: Elf64_Word,
}
#[test]
fn bindgen_test_layout_Elf64_Verneed() {
    assert_eq!(::std::mem::size_of::<Elf64_Verneed>() , 16usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Verneed ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Verneed>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Verneed ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Verneed ) ) . vn_version as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Verneed ) , "::"
                , stringify ! ( vn_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Verneed ) ) . vn_cnt as * const _
                as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Verneed ) , "::"
                , stringify ! ( vn_cnt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Verneed ) ) . vn_file as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Verneed ) , "::"
                , stringify ! ( vn_file ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Verneed ) ) . vn_aux as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Verneed ) , "::"
                , stringify ! ( vn_aux ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Verneed ) ) . vn_next as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Verneed ) , "::"
                , stringify ! ( vn_next ) ));
}
impl Clone for Elf64_Verneed {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Vernaux {
    pub vna_hash: Elf32_Word,
    pub vna_flags: Elf32_Half,
    pub vna_other: Elf32_Half,
    pub vna_name: Elf32_Word,
    pub vna_next: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Vernaux() {
    assert_eq!(::std::mem::size_of::<Elf32_Vernaux>() , 16usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Vernaux ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Vernaux>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Vernaux ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Vernaux ) ) . vna_hash as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Vernaux ) , "::"
                , stringify ! ( vna_hash ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Vernaux ) ) . vna_flags as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Vernaux ) , "::"
                , stringify ! ( vna_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Vernaux ) ) . vna_other as * const
                _ as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Vernaux ) , "::"
                , stringify ! ( vna_other ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Vernaux ) ) . vna_name as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Vernaux ) , "::"
                , stringify ! ( vna_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Vernaux ) ) . vna_next as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Vernaux ) , "::"
                , stringify ! ( vna_next ) ));
}
impl Clone for Elf32_Vernaux {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Vernaux {
    pub vna_hash: Elf64_Word,
    pub vna_flags: Elf64_Half,
    pub vna_other: Elf64_Half,
    pub vna_name: Elf64_Word,
    pub vna_next: Elf64_Word,
}
#[test]
fn bindgen_test_layout_Elf64_Vernaux() {
    assert_eq!(::std::mem::size_of::<Elf64_Vernaux>() , 16usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Vernaux ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Vernaux>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Vernaux ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Vernaux ) ) . vna_hash as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Vernaux ) , "::"
                , stringify ! ( vna_hash ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Vernaux ) ) . vna_flags as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Vernaux ) , "::"
                , stringify ! ( vna_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Vernaux ) ) . vna_other as * const
                _ as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Vernaux ) , "::"
                , stringify ! ( vna_other ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Vernaux ) ) . vna_name as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Vernaux ) , "::"
                , stringify ! ( vna_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Vernaux ) ) . vna_next as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Vernaux ) , "::"
                , stringify ! ( vna_next ) ));
}
impl Clone for Elf64_Vernaux {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_auxv_t {
    pub a_type: u32,
    pub a_un: Elf32_auxv_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_auxv_t__bindgen_ty_1 {
    pub a_val: __BindgenUnionField<u32>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_Elf32_auxv_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<Elf32_auxv_t__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( Elf32_auxv_t__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<Elf32_auxv_t__bindgen_ty_1>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( Elf32_auxv_t__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_auxv_t__bindgen_ty_1 ) ) . a_val as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                Elf32_auxv_t__bindgen_ty_1 ) , "::" , stringify ! ( a_val )
                ));
}
impl Clone for Elf32_auxv_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_Elf32_auxv_t() {
    assert_eq!(::std::mem::size_of::<Elf32_auxv_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( Elf32_auxv_t ) ));
    assert_eq! (::std::mem::align_of::<Elf32_auxv_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_auxv_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_auxv_t ) ) . a_type as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_auxv_t ) , "::" ,
                stringify ! ( a_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_auxv_t ) ) . a_un as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_auxv_t ) , "::" ,
                stringify ! ( a_un ) ));
}
impl Clone for Elf32_auxv_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_auxv_t {
    pub a_type: u64,
    pub a_un: Elf64_auxv_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_auxv_t__bindgen_ty_1 {
    pub a_val: __BindgenUnionField<u64>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_Elf64_auxv_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<Elf64_auxv_t__bindgen_ty_1>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( Elf64_auxv_t__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<Elf64_auxv_t__bindgen_ty_1>() , 8usize
                , concat ! (
                "Alignment of " , stringify ! ( Elf64_auxv_t__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_auxv_t__bindgen_ty_1 ) ) . a_val as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                Elf64_auxv_t__bindgen_ty_1 ) , "::" , stringify ! ( a_val )
                ));
}
impl Clone for Elf64_auxv_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_Elf64_auxv_t() {
    assert_eq!(::std::mem::size_of::<Elf64_auxv_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( Elf64_auxv_t ) ));
    assert_eq! (::std::mem::align_of::<Elf64_auxv_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_auxv_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_auxv_t ) ) . a_type as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_auxv_t ) , "::" ,
                stringify ! ( a_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_auxv_t ) ) . a_un as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_auxv_t ) , "::" ,
                stringify ! ( a_un ) ));
}
impl Clone for Elf64_auxv_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Nhdr {
    pub n_namesz: Elf32_Word,
    pub n_descsz: Elf32_Word,
    pub n_type: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Nhdr() {
    assert_eq!(::std::mem::size_of::<Elf32_Nhdr>() , 12usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Nhdr ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Nhdr>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Nhdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Nhdr ) ) . n_namesz as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Nhdr ) , "::" ,
                stringify ! ( n_namesz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Nhdr ) ) . n_descsz as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Nhdr ) , "::" ,
                stringify ! ( n_descsz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Nhdr ) ) . n_type as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Nhdr ) , "::" ,
                stringify ! ( n_type ) ));
}
impl Clone for Elf32_Nhdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Nhdr {
    pub n_namesz: Elf64_Word,
    pub n_descsz: Elf64_Word,
    pub n_type: Elf64_Word,
}
#[test]
fn bindgen_test_layout_Elf64_Nhdr() {
    assert_eq!(::std::mem::size_of::<Elf64_Nhdr>() , 12usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Nhdr ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Nhdr>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Nhdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Nhdr ) ) . n_namesz as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Nhdr ) , "::" ,
                stringify ! ( n_namesz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Nhdr ) ) . n_descsz as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Nhdr ) , "::" ,
                stringify ! ( n_descsz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Nhdr ) ) . n_type as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Nhdr ) , "::" ,
                stringify ! ( n_type ) ));
}
impl Clone for Elf64_Nhdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Move {
    pub m_value: Elf32_Xword,
    pub m_info: Elf32_Word,
    pub m_poffset: Elf32_Word,
    pub m_repeat: Elf32_Half,
    pub m_stride: Elf32_Half,
}
#[test]
fn bindgen_test_layout_Elf32_Move() {
    assert_eq!(::std::mem::size_of::<Elf32_Move>() , 24usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Move ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Move>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Move ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Move ) ) . m_value as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Move ) , "::" ,
                stringify ! ( m_value ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Move ) ) . m_info as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Move ) , "::" ,
                stringify ! ( m_info ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Move ) ) . m_poffset as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Move ) , "::" ,
                stringify ! ( m_poffset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Move ) ) . m_repeat as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Move ) , "::" ,
                stringify ! ( m_repeat ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Move ) ) . m_stride as * const _ as
                usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Move ) , "::" ,
                stringify ! ( m_stride ) ));
}
impl Clone for Elf32_Move {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Move {
    pub m_value: Elf64_Xword,
    pub m_info: Elf64_Xword,
    pub m_poffset: Elf64_Xword,
    pub m_repeat: Elf64_Half,
    pub m_stride: Elf64_Half,
}
#[test]
fn bindgen_test_layout_Elf64_Move() {
    assert_eq!(::std::mem::size_of::<Elf64_Move>() , 32usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Move ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Move>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Move ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Move ) ) . m_value as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Move ) , "::" ,
                stringify ! ( m_value ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Move ) ) . m_info as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Move ) , "::" ,
                stringify ! ( m_info ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Move ) ) . m_poffset as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Move ) , "::" ,
                stringify ! ( m_poffset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Move ) ) . m_repeat as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Move ) , "::" ,
                stringify ! ( m_repeat ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Move ) ) . m_stride as * const _ as
                usize } , 26usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Move ) , "::" ,
                stringify ! ( m_stride ) ));
}
impl Clone for Elf64_Move {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_gptab {
    pub gt_header: __BindgenUnionField<Elf32_gptab__bindgen_ty_1>,
    pub gt_entry: __BindgenUnionField<Elf32_gptab__bindgen_ty_2>,
    pub bindgen_union_field: [u32; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_gptab__bindgen_ty_1 {
    pub gt_current_g_value: Elf32_Word,
    pub gt_unused: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_gptab__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<Elf32_gptab__bindgen_ty_1>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( Elf32_gptab__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<Elf32_gptab__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( Elf32_gptab__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_gptab__bindgen_ty_1 ) ) .
                gt_current_g_value as * const _ as usize } , 0usize , concat !
                (
                "Alignment of field: " , stringify ! (
                Elf32_gptab__bindgen_ty_1 ) , "::" , stringify ! (
                gt_current_g_value ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_gptab__bindgen_ty_1 ) ) . gt_unused
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                Elf32_gptab__bindgen_ty_1 ) , "::" , stringify ! ( gt_unused )
                ));
}
impl Clone for Elf32_gptab__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_gptab__bindgen_ty_2 {
    pub gt_g_value: Elf32_Word,
    pub gt_bytes: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_gptab__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<Elf32_gptab__bindgen_ty_2>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( Elf32_gptab__bindgen_ty_2 ) ));
    assert_eq! (::std::mem::align_of::<Elf32_gptab__bindgen_ty_2>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( Elf32_gptab__bindgen_ty_2 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_gptab__bindgen_ty_2 ) ) .
                gt_g_value as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                Elf32_gptab__bindgen_ty_2 ) , "::" , stringify ! ( gt_g_value
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_gptab__bindgen_ty_2 ) ) . gt_bytes
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                Elf32_gptab__bindgen_ty_2 ) , "::" , stringify ! ( gt_bytes )
                ));
}
impl Clone for Elf32_gptab__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_Elf32_gptab() {
    assert_eq!(::std::mem::size_of::<Elf32_gptab>() , 8usize , concat ! (
               "Size of: " , stringify ! ( Elf32_gptab ) ));
    assert_eq! (::std::mem::align_of::<Elf32_gptab>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_gptab ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_gptab ) ) . gt_header as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_gptab ) , "::" ,
                stringify ! ( gt_header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_gptab ) ) . gt_entry as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_gptab ) , "::" ,
                stringify ! ( gt_entry ) ));
}
impl Clone for Elf32_gptab {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_RegInfo {
    pub ri_gprmask: Elf32_Word,
    pub ri_cprmask: [Elf32_Word; 4usize],
    pub ri_gp_value: Elf32_Sword,
}
#[test]
fn bindgen_test_layout_Elf32_RegInfo() {
    assert_eq!(::std::mem::size_of::<Elf32_RegInfo>() , 24usize , concat ! (
               "Size of: " , stringify ! ( Elf32_RegInfo ) ));
    assert_eq! (::std::mem::align_of::<Elf32_RegInfo>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_RegInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_RegInfo ) ) . ri_gprmask as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_RegInfo ) , "::"
                , stringify ! ( ri_gprmask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_RegInfo ) ) . ri_cprmask as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_RegInfo ) , "::"
                , stringify ! ( ri_cprmask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_RegInfo ) ) . ri_gp_value as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_RegInfo ) , "::"
                , stringify ! ( ri_gp_value ) ));
}
impl Clone for Elf32_RegInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf_Options {
    pub kind: ::std::os::raw::c_uchar,
    pub size: ::std::os::raw::c_uchar,
    pub section: Elf32_Section,
    pub info: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf_Options() {
    assert_eq!(::std::mem::size_of::<Elf_Options>() , 8usize , concat ! (
               "Size of: " , stringify ! ( Elf_Options ) ));
    assert_eq! (::std::mem::align_of::<Elf_Options>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf_Options ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Options ) ) . kind as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Options ) , "::" ,
                stringify ! ( kind ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Options ) ) . size as * const _ as
                usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Options ) , "::" ,
                stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Options ) ) . section as * const _ as
                usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Options ) , "::" ,
                stringify ! ( section ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Options ) ) . info as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Options ) , "::" ,
                stringify ! ( info ) ));
}
impl Clone for Elf_Options {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf_Options_Hw {
    pub hwp_flags1: Elf32_Word,
    pub hwp_flags2: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf_Options_Hw() {
    assert_eq!(::std::mem::size_of::<Elf_Options_Hw>() , 8usize , concat ! (
               "Size of: " , stringify ! ( Elf_Options_Hw ) ));
    assert_eq! (::std::mem::align_of::<Elf_Options_Hw>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf_Options_Hw ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Options_Hw ) ) . hwp_flags1 as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Options_Hw ) , "::"
                , stringify ! ( hwp_flags1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Options_Hw ) ) . hwp_flags2 as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Options_Hw ) , "::"
                , stringify ! ( hwp_flags2 ) ));
}
impl Clone for Elf_Options_Hw {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf32_Lib {
    pub l_name: Elf32_Word,
    pub l_time_stamp: Elf32_Word,
    pub l_checksum: Elf32_Word,
    pub l_version: Elf32_Word,
    pub l_flags: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Lib() {
    assert_eq!(::std::mem::size_of::<Elf32_Lib>() , 20usize , concat ! (
               "Size of: " , stringify ! ( Elf32_Lib ) ));
    assert_eq! (::std::mem::align_of::<Elf32_Lib>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf32_Lib ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Lib ) ) . l_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Lib ) , "::" ,
                stringify ! ( l_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Lib ) ) . l_time_stamp as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Lib ) , "::" ,
                stringify ! ( l_time_stamp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Lib ) ) . l_checksum as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Lib ) , "::" ,
                stringify ! ( l_checksum ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Lib ) ) . l_version as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Lib ) , "::" ,
                stringify ! ( l_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf32_Lib ) ) . l_flags as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf32_Lib ) , "::" ,
                stringify ! ( l_flags ) ));
}
impl Clone for Elf32_Lib {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf64_Lib {
    pub l_name: Elf64_Word,
    pub l_time_stamp: Elf64_Word,
    pub l_checksum: Elf64_Word,
    pub l_version: Elf64_Word,
    pub l_flags: Elf64_Word,
}
#[test]
fn bindgen_test_layout_Elf64_Lib() {
    assert_eq!(::std::mem::size_of::<Elf64_Lib>() , 20usize , concat ! (
               "Size of: " , stringify ! ( Elf64_Lib ) ));
    assert_eq! (::std::mem::align_of::<Elf64_Lib>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Elf64_Lib ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Lib ) ) . l_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Lib ) , "::" ,
                stringify ! ( l_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Lib ) ) . l_time_stamp as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Lib ) , "::" ,
                stringify ! ( l_time_stamp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Lib ) ) . l_checksum as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Lib ) , "::" ,
                stringify ! ( l_checksum ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Lib ) ) . l_version as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Lib ) , "::" ,
                stringify ! ( l_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf64_Lib ) ) . l_flags as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf64_Lib ) , "::" ,
                stringify ! ( l_flags ) ));
}
impl Clone for Elf64_Lib {
    fn clone(&self) -> Self { *self }
}
pub type Elf32_Conflict = Elf32_Addr;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf_MIPS_ABIFlags_v0 {
    pub version: Elf32_Half,
    pub isa_level: ::std::os::raw::c_uchar,
    pub isa_rev: ::std::os::raw::c_uchar,
    pub gpr_size: ::std::os::raw::c_uchar,
    pub cpr1_size: ::std::os::raw::c_uchar,
    pub cpr2_size: ::std::os::raw::c_uchar,
    pub fp_abi: ::std::os::raw::c_uchar,
    pub isa_ext: Elf32_Word,
    pub ases: Elf32_Word,
    pub flags1: Elf32_Word,
    pub flags2: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf_MIPS_ABIFlags_v0() {
    assert_eq!(::std::mem::size_of::<Elf_MIPS_ABIFlags_v0>() , 24usize ,
               concat ! ( "Size of: " , stringify ! ( Elf_MIPS_ABIFlags_v0 )
               ));
    assert_eq! (::std::mem::align_of::<Elf_MIPS_ABIFlags_v0>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( Elf_MIPS_ABIFlags_v0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_MIPS_ABIFlags_v0 ) ) . version as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_MIPS_ABIFlags_v0 )
                , "::" , stringify ! ( version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_MIPS_ABIFlags_v0 ) ) . isa_level as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_MIPS_ABIFlags_v0 )
                , "::" , stringify ! ( isa_level ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_MIPS_ABIFlags_v0 ) ) . isa_rev as *
                const _ as usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_MIPS_ABIFlags_v0 )
                , "::" , stringify ! ( isa_rev ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_MIPS_ABIFlags_v0 ) ) . gpr_size as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_MIPS_ABIFlags_v0 )
                , "::" , stringify ! ( gpr_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_MIPS_ABIFlags_v0 ) ) . cpr1_size as *
                const _ as usize } , 5usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_MIPS_ABIFlags_v0 )
                , "::" , stringify ! ( cpr1_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_MIPS_ABIFlags_v0 ) ) . cpr2_size as *
                const _ as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_MIPS_ABIFlags_v0 )
                , "::" , stringify ! ( cpr2_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_MIPS_ABIFlags_v0 ) ) . fp_abi as *
                const _ as usize } , 7usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_MIPS_ABIFlags_v0 )
                , "::" , stringify ! ( fp_abi ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_MIPS_ABIFlags_v0 ) ) . isa_ext as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_MIPS_ABIFlags_v0 )
                , "::" , stringify ! ( isa_ext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_MIPS_ABIFlags_v0 ) ) . ases as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_MIPS_ABIFlags_v0 )
                , "::" , stringify ! ( ases ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_MIPS_ABIFlags_v0 ) ) . flags1 as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_MIPS_ABIFlags_v0 )
                , "::" , stringify ! ( flags1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_MIPS_ABIFlags_v0 ) ) . flags2 as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_MIPS_ABIFlags_v0 )
                , "::" , stringify ! ( flags2 ) ));
}
impl Clone for Elf_MIPS_ABIFlags_v0 {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum Elf_Type {
    ELF_T_BYTE = 0,
    ELF_T_ADDR = 1,
    ELF_T_DYN = 2,
    ELF_T_EHDR = 3,
    ELF_T_HALF = 4,
    ELF_T_OFF = 5,
    ELF_T_PHDR = 6,
    ELF_T_RELA = 7,
    ELF_T_REL = 8,
    ELF_T_SHDR = 9,
    ELF_T_SWORD = 10,
    ELF_T_SYM = 11,
    ELF_T_WORD = 12,
    ELF_T_XWORD = 13,
    ELF_T_SXWORD = 14,
    ELF_T_VDEF = 15,
    ELF_T_VDAUX = 16,
    ELF_T_VNEED = 17,
    ELF_T_VNAUX = 18,
    ELF_T_NHDR = 19,
    ELF_T_SYMINFO = 20,
    ELF_T_MOVE = 21,
    ELF_T_LIB = 22,
    ELF_T_GNUHASH = 23,
    ELF_T_AUXV = 24,
    ELF_T_CHDR = 25,
    ELF_T_NUM = 26,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf_Data {
    pub d_buf: *mut ::std::os::raw::c_void,
    pub d_type: Elf_Type,
    pub d_version: ::std::os::raw::c_uint,
    pub d_size: usize,
    pub d_off: i64,
    pub d_align: usize,
}
#[test]
fn bindgen_test_layout_Elf_Data() {
    assert_eq!(::std::mem::size_of::<Elf_Data>() , 40usize , concat ! (
               "Size of: " , stringify ! ( Elf_Data ) ));
    assert_eq! (::std::mem::align_of::<Elf_Data>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Elf_Data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Data ) ) . d_buf as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Data ) , "::" ,
                stringify ! ( d_buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Data ) ) . d_type as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Data ) , "::" ,
                stringify ! ( d_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Data ) ) . d_version as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Data ) , "::" ,
                stringify ! ( d_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Data ) ) . d_size as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Data ) , "::" ,
                stringify ! ( d_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Data ) ) . d_off as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Data ) , "::" ,
                stringify ! ( d_off ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Data ) ) . d_align as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Data ) , "::" ,
                stringify ! ( d_align ) ));
}
impl Clone for Elf_Data {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum Elf_Cmd {
    ELF_C_NULL = 0,
    ELF_C_READ = 1,
    ELF_C_RDWR = 2,
    ELF_C_WRITE = 3,
    ELF_C_CLR = 4,
    ELF_C_SET = 5,
    ELF_C_FDDONE = 6,
    ELF_C_FDREAD = 7,
    ELF_C_READ_MMAP = 8,
    ELF_C_RDWR_MMAP = 9,
    ELF_C_WRITE_MMAP = 10,
    ELF_C_READ_MMAP_PRIVATE = 11,
    ELF_C_EMPTY = 12,
    ELF_C_NUM = 13,
}
pub const ELF_F_DIRTY: _bindgen_ty_2 = _bindgen_ty_2::ELF_F_DIRTY;
pub const ELF_F_LAYOUT: _bindgen_ty_2 = _bindgen_ty_2::ELF_F_LAYOUT;
pub const ELF_F_PERMISSIVE: _bindgen_ty_2 = _bindgen_ty_2::ELF_F_PERMISSIVE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_2 {
    ELF_F_DIRTY = 1,
    ELF_F_LAYOUT = 4,
    ELF_F_PERMISSIVE = 8,
}
pub const ELF_CHF_FORCE: _bindgen_ty_3 = _bindgen_ty_3::ELF_CHF_FORCE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_3 { ELF_CHF_FORCE = 1, }
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum Elf_Kind {
    ELF_K_NONE = 0,
    ELF_K_AR = 1,
    ELF_K_COFF = 2,
    ELF_K_ELF = 3,
    ELF_K_NUM = 4,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf_Arhdr {
    pub ar_name: *mut ::std::os::raw::c_char,
    pub ar_date: time_t,
    pub ar_uid: uid_t,
    pub ar_gid: gid_t,
    pub ar_mode: mode_t,
    pub ar_size: i64,
    pub ar_rawname: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_Elf_Arhdr() {
    assert_eq!(::std::mem::size_of::<Elf_Arhdr>() , 48usize , concat ! (
               "Size of: " , stringify ! ( Elf_Arhdr ) ));
    assert_eq! (::std::mem::align_of::<Elf_Arhdr>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Elf_Arhdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Arhdr ) ) . ar_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Arhdr ) , "::" ,
                stringify ! ( ar_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Arhdr ) ) . ar_date as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Arhdr ) , "::" ,
                stringify ! ( ar_date ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Arhdr ) ) . ar_uid as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Arhdr ) , "::" ,
                stringify ! ( ar_uid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Arhdr ) ) . ar_gid as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Arhdr ) , "::" ,
                stringify ! ( ar_gid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Arhdr ) ) . ar_mode as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Arhdr ) , "::" ,
                stringify ! ( ar_mode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Arhdr ) ) . ar_size as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Arhdr ) , "::" ,
                stringify ! ( ar_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Arhdr ) ) . ar_rawname as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Arhdr ) , "::" ,
                stringify ! ( ar_rawname ) ));
}
impl Clone for Elf_Arhdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct Elf_Arsym {
    pub as_name: *mut ::std::os::raw::c_char,
    pub as_off: usize,
    pub as_hash: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_Elf_Arsym() {
    assert_eq!(::std::mem::size_of::<Elf_Arsym>() , 24usize , concat ! (
               "Size of: " , stringify ! ( Elf_Arsym ) ));
    assert_eq! (::std::mem::align_of::<Elf_Arsym>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Elf_Arsym ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Arsym ) ) . as_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Arsym ) , "::" ,
                stringify ! ( as_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Arsym ) ) . as_off as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Arsym ) , "::" ,
                stringify ! ( as_off ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Elf_Arsym ) ) . as_hash as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( Elf_Arsym ) , "::" ,
                stringify ! ( as_hash ) ));
}
impl Clone for Elf_Arsym {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf([u8; 0]);
#[repr(C)]
